# St7GetModelWindowPosition

Returns the screen position of the model window.

long St7GetModelWindowPosition(long uID, long* Left, long* Top, long* Width,

long* Height)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Left

Pixel position of the left edge of the model window.

Top

Pixel position of the top edge of the model window.

Width

Pixel width of the model window.

Height

Pixel height of the model window.

Strand7 API Manual